
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 9 to add, 2 to change, 3 to destroy.</code></pre>

* Create
  * module.apim_apis.azurerm_api_management_api_operation.apim_api_operation[&#34;hmi-health-check&#34;]
  * module.apim_apis.azurerm_api_management_api_operation.apim_api_operation[&#34;publication-health&#34;]
  * module.apim_apis.azurerm_api_management_api_operation.apim_api_operation[&#34;update-publication&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;hmi-health-check&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;publication-health&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;update-publication&#34;]
* Update
  * module.api_mgmt_product.azurerm_api_management_product.product
  * module.apim_apis.azurerm_api_management_api.apim_api
* Replace
  * module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag[&#34;hmi-health-check&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag[&#34;publication-health&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag[&#34;update-publication&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.api_mgmt_product.azurerm_api_management_product.product will be updated in-place
  ~ resource "azurerm_api_management_product" "product" {
        id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/products/hmi-product-stg"
      ~ subscriptions_limit   = 0 -> 20
        # (7 unchanged attributes hidden)
    }

  # module.apim_apis.data.azurerm_api_management_product.apim_product will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_api_management_product" "apim_product" {
      + api_management_name   = "sds-api-mgmt-stg"
      + approval_required     = (known after apply)
      + description           = (known after apply)
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + product_id            = "hmi-product-stg"
      + published             = (known after apply)
      + resource_group_name   = "ss-stg-network-rg"
      + subscription_required = (known after apply)
      + subscriptions_limit   = (known after apply)
      + terms                 = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.apim_apis.azurerm_api_management_api.apim_api will be updated in-place
  ~ resource "azurerm_api_management_api" "apim_api" {
        id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim"
        name                  = "hmi-apim"
      ~ service_url           = "https://sds-api-mgmt.staging.platform.hmcts.net/hmi/" -> "https://hmi-apim.staging.platform.hmcts.net"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.apim_apis.azurerm_api_management_api_operation.apim_api_operation["hmi-health-check"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_operation" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + description         = "Health check for HMI"
      + display_name        = "HMI Health Check"
      + id                  = (known after apply)
      + method              = "GET"
      + operation_id        = "hmi-health-check"
      + resource_group_name = "ss-stg-network-rg"
      + url_template        = "/"

      + request {
        }

      + response {
          + status_code = 200
        }
    }

  # module.apim_apis.azurerm_api_management_api_operation.apim_api_operation["publication-health"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_operation" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + description         = "Health check for CaTH"
      + display_name        = "Publication Health"
      + id                  = (known after apply)
      + method              = "GET"
      + operation_id        = "publication-health"
      + resource_group_name = "ss-stg-network-rg"
      + url_template        = "/pih/health"

      + request {
        }

      + response {
          + status_code = 200
        }
    }

  # module.apim_apis.azurerm_api_management_api_operation.apim_api_operation["update-publication"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_operation" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + description         = "Publication of an artefact"
      + display_name        = "Publication"
      + id                  = (known after apply)
      + method              = "POST"
      + operation_id        = "update-publication"
      + resource_group_name = "ss-stg-network-rg"
      + url_template        = "/pih/publication"

      + request {
          + header {
              + default_value = "CFT"
              + name          = "Source-System"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "PIH"
              + name          = "Destination-System"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "2019-10-12T07:20:00Z"
              + name          = "Request-Created-At"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "application/json"
              + name          = "Accept"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "application/json"
              + name          = "Content-Type"
              + required      = false
              + type          = "string"
            }
        }

      + response {
          + status_code = 201
        }
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["hmi-health-check"] will be created
  + resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + id                  = (known after apply)
      + operation_id        = "hmi-health-check"
      + resource_group_name = "ss-stg-network-rg"
      + xml_content         = (sensitive value)
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["publication-health"] will be created
  + resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + id                  = (known after apply)
      + operation_id        = "publication-health"
      + resource_group_name = "ss-stg-network-rg"
      + xml_content         = (sensitive value)
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["update-publication"] will be created
  + resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + id                  = (known after apply)
      + operation_id        = "update-publication"
      + resource_group_name = "ss-stg-network-rg"
      + xml_content         = (sensitive value)
    }

  # module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag["hmi-health-check"] must be replaced
-/+ resource "azurerm_api_management_api_operation_tag" "apim_api_tag" {
      ~ api_operation_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim/operations/hmi-health-check" -> (known after apply) # forces replacement
      ~ id               = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim/operations/hmi-health-check/tags/health-check" -> (known after apply)
        name             = "health-check"
        # (1 unchanged attribute hidden)
    }

  # module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag["publication-health"] must be replaced
-/+ resource "azurerm_api_management_api_operation_tag" "apim_api_tag" {
      ~ api_operation_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim/operations/publication-health" -> (known after apply) # forces replacement
      ~ id               = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim/operations/publication-health/tags/CaTH" -> (known after apply)
        name             = "CaTH"
        # (1 unchanged attribute hidden)
    }

  # module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag["update-publication"] must be replaced
-/+ resource "azurerm_api_management_api_operation_tag" "apim_api_tag" {
      ~ api_operation_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim/operations/update-publication" -> (known after apply) # forces replacement
      ~ id               = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim/operations/update-publication/tags/CaTH" -> (known after apply)
        name             = "CaTH"
        # (1 unchanged attribute hidden)
    }

Plan: 9 to add, 2 to change, 3 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.apim_apis.azurerm_api_management_api_operation.apim_api_operation["hmi-health-check"] has been deleted
  - resource "azurerm_api_management_api_operation" "apim_api_operation" {
      - api_management_name = "sds-api-mgmt-stg" -> null
      - api_name            = "hmi-apim" -> null
      - description         = "Health check for HMI" -> null
      - display_name        = "HMI Health Check" -> null
      - id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim/operations/hmi-health-check" -> null
      - method              = "GET" -> null
      - operation_id        = "hmi-health-check" -> null
      - resource_group_name = "ss-stg-network-rg" -> null
      - url_template        = "/" -> null

      - request {
        }

      - response {
          - status_code = 200 -> null
        }
    }

  # module.apim_apis.azurerm_api_management_api_operation.apim_api_operation["publication-health"] has been deleted
  - resource "azurerm_api_management_api_operation" "apim_api_operation" {
      - api_management_name = "sds-api-mgmt-stg" -> null
      - api_name            = "hmi-apim" -> null
      - description         = "Health check for CaTH" -> null
      - display_name        = "Publication Health" -> null
      - id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim/operations/publication-health" -> null
      - method              = "GET" -> null
      - operation_id        = "publication-health" -> null
      - resource_group_name = "ss-stg-network-rg" -> null
      - url_template        = "/pih/health" -> null

      - request {
        }

      - response {
          - status_code = 200 -> null
        }
    }

  # module.apim_apis.azurerm_api_management_api_operation.apim_api_operation["update-publication"] has been deleted
  - resource "azurerm_api_management_api_operation" "apim_api_operation" {
      - api_management_name = "sds-api-mgmt-stg" -> null
      - api_name            = "hmi-apim" -> null
      - description         = "Publication of an artefact" -> null
      - display_name        = "Publication" -> null
      - id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim/operations/update-publication" -> null
      - method              = "POST" -> null
      - operation_id        = "update-publication" -> null
      - resource_group_name = "ss-stg-network-rg" -> null
      - url_template        = "/pih/publication" -> null

      - request {
          - header {
              - default_value = "CFT" -> null
              - name          = "Source-System" -> null
              - required      = true -> null
              - type          = "string" -> null
              - values        = [] -> null
            }
          - header {
              - default_value = "PIH" -> null
              - name          = "Destination-System" -> null
              - required      = true -> null
              - type          = "string" -> null
              - values        = [] -> null
            }
          - header {
              - default_value = "2019-10-12T07:20:00Z" -> null
              - name          = "Request-Created-At" -> null
              - required      = true -> null
              - type          = "string" -> null
              - values        = [] -> null
            }
          - header {
              - default_value = "application/json" -> null
              - name          = "Accept" -> null
              - required      = true -> null
              - type          = "string" -> null
              - values        = [] -> null
            }
          - header {
              - default_value = "application/json" -> null
              - name          = "Content-Type" -> null
              - required      = false -> null
              - type          = "string" -> null
              - values        = [] -> null
            }
        }

      - response {
          - status_code = 201 -> null
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":11,"Program":"tfcmt","SHA1":"","Vars":{}} -->